{
  "backend/main.mo": "Motoko canister handling user‑scoped session storage, category analysis, reconsideration stats, and access‑controlled save/query operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing concise summaries for all frontend files and their roles.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark design tokens and base styling rules.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Main React app with routing, theme provider, layout, and authenticated routes for loop, history, session details, and analytics.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth wrapper that prompts unauthenticated users to sign in and otherwise renders children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing on sign‑out.",
  "frontend/src/components/layout/GlassCard.tsx": "Reusable glass‑styled container div with blur and border aesthetics.",
  "frontend/src/components/layout/MinimalNav.tsx": "Minimal navigation bar linking to Loop, History, and Analytics with active route highlighting.",
  "frontend/src/components/ux/DelayedActionButton.tsx": "Button that enables after a short delay to encourage user pause before acting.",
  "frontend/src/components/ux/FadeIn.tsx": "A wrapper component that fades in its children after an optional delay using CSS transitions.",
  "frontend/src/features/analytics/AnalyticsDashboardScreen.tsx": "Displays the analytics dashboard with three metric cards inside a FadeIn container.",
  "frontend/src/features/analytics/widgets/CategoryBreakdownCard.tsx": "Shows the most common decision category, fetching category counts and displaying the top result or a skeleton/empty state.",
  "frontend/src/features/analytics/widgets/ReconsiderationRateCard.tsx": "Fetches and displays the percentage of reconsidered decisions, with loading and static info text.",
  "frontend/src/features/analytics/widgets/TimeOfDayPatternCard.tsx": "Analyzes session timestamps to determine the most active time of day and displays the leading period.",
  "frontend/src/features/history/PastDecisionsScreen.tsx": "Lists all past decision sessions with timestamps and summaries, linking to their detailed pages.",
  "frontend/src/features/history/SessionDetailsScreen.tsx": "Shows full details of a specific session including metadata and all stage responses, with navigation back to history.",
  "frontend/src/features/loop/LoopScreen.tsx": "Routes the user through the reflection loop stages based on the loop machine’s current state.",
  "frontend/src/features/loop/stages/CompletionScreen.tsx": "Final step of the loop allowing category selection and saving the session before reset or navigation.",
  "frontend/src/features/loop/stages/IdleScreen.tsx": "Initial screen where the user enters an action title to start the reflection loop.",
  "frontend/src/features/loop/stages/Stage1ActionDeclaration.tsx": "Asks the user if they want to proceed with the action, offering delayed yes/no buttons.",
  "frontend/src/features/loop/stages/Stage2FutureSelf.tsx": "Handles stage 2 prompts asking if an action aligns with the user's future self and collects a follow-up yes/no or text response.",
  "frontend/src/features/loop/stages/Stage3ForcedReflection.tsx": "Shows a reflection screen summarizing the user's choice and alignment, prompting them to continue or reconsider.",
  "frontend/src/features/loop/stages/Stage3Gate.tsx": "Displays a gate screen asking the user to explicitly accept consequences before proceeding.",
  "frontend/src/features/loop/stages/Stage4ConsequenceVisualization.tsx": "Presents a visual comparison of short-term vs long-term effects with optional heartbeat audio and a completion button.",
  "frontend/src/features/loop/types.ts": "Defines loop stage types, loop state structure, and available action categories.",
  "frontend/src/features/loop/useLoopMachine.ts": "Implements a state machine managing loop progression, responses, decisions, and resets.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity persistence, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching sessions, stats, category analysis, and saving session data.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dark mode values, and custom animation utilities.",
  "frontend/src/lib/utils.ts": "Provides a utility function for merging Tailwind class names.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Stores project metadata including app goals, architecture notes, required images, and implemented feature records."
}